title: Discovery - Process Discovery - Tasklist - T1057
id: 
status: experimental
description: Detects enumeratation of processes using Tasklist.exe and other command-line utilities
author: Bryan Bolesta
date: 2020/01/12
modified: 2020/01/12
references:
    - https://attack.mitre.org/techniques/T1057/
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        CommandLine:
            - '*tasklist*'
            - '*ps*'
            - '*get-process*'
    selection2:
        Image:
            - '*\tasklist.exe'
    condition: selection1 or selection2
falsepositives: 
    - Unknown
level: high
tags:
    - attack.discovery
    - attack.t1057
