title: Discovery - System Network Connections Discovery - Netstat - T1049
id: 
status: experimental
description: Detects enumeration of account information via net.exe
author: Bryan Bolesta
date: 2020/01/12
modified: 2020/01/12
references:
    - https://attack.mitre.org/techniques/T1049/
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        Image:
            - '*\net.exe'
        CommandLine:
            - '*use*'
            - '*session*'
    selection2:
        Image:
            - '*\netstat.exe'
    selection3:
        Image:
            - '*\netsh.exe'
        CommandLine:
            - '*wlan show*'
    condition: selection1 or selection2 or selection3
falsepositives: 
    - Unknown
level: high
tags:
    - attack.discovery
    - attack.t1049
