title: Discovery - Network Share Discovery - Net - T1135
id: 
status: experimental
description: Detects enumeration of network share information via net.exe
author: Bryan Bolesta
date: 2020/01/12
modified: 2020/01/12
references:
    - https://attack.mitre.org/techniques/T1135/
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image:
            - '*\net.exe'
        CommandLine:
            - '*view*'
            - '*share*'
    condition: selection
falsepositives: 
    - Unknown
level: high
tags:
    - attack.discovery
    - attack.t1135
