title: Discovery - Password Policy Discovery - Net - T1201
id: 
status: experimental
description: Detects enumeration of password policy information via net.exe
author: Bryan Bolesta
date: 2020/01/12
modified: 2020/01/12
references:
    - https://attack.mitre.org/techniques/T1201/
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image:
            - '*\net.exe'
        CommandLine:
            - '*accounts*'
    condition: selection
falsepositives: 
    - Unknown
level: high
tags:
    - attack.discovery
    - attack.t1201
