title: Execution - Scheduled Task - Schtasks - T1053
id: 
status: experimental
description: Detects creation, modification, and execution of scheduled tasks using Schtasks.exe
author: Bryan Bolesta
date: 2020/01/12
modified: 2020/01/12
references:
    - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image:
            - '*\schtasks.exe'
        CommandLine:
            - '*create*'
            - '*change*'
            - '*run*'
            - '*delete*'
    condition: selection
falsepositives: 
    - Unknown
level: high
tags:
    - attack.execution
    - attack.t1053
