title: Defense Evasion - Modify Registry - Reg - T1036
id: 
status: experimental
description: Detects changes to the registry using the REG command
author: Bryan Bolesta
date: 2020/01/20
modified: 2020/01/20
references:
    - https://attack.mitre.org/techniques/T1036/
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image:
            - '*\reg.exe'
        CommandLine:
            - '*add*'
            - '*delete*'
            - '*import*'
            - '*unload*'
            - '*load*'
    condition: selection
falsepositives: 
    - Unknown
level: high
tags:
    - attack.defense_evasion
    - attack.t1036
