title: Persistence - Accessibility Features - Suspicious Accessibility Programs - T1015
id: 
status: experimental
description: Detects Accessibility Features suspiciously launched by PowerShell or CMD
author: Bryan Bolesta
date: 2020/01/12
modified: 2020/01/12
references:
    - https://attack.mitre.org/techniques/T1015/
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage:
            - '*\powershell.exe'
            - '*\cmd.exe'
        Image:
            - '*\osk.exe'
            - '*\Magnify.exe'
            - '*\Narrator.exe'
            - '*\DisplaySwitch.exe'
            - '*\AtBroker.exe'
            - '*\sethc.exe'
            - '*\Utilman.exe'
    condition: selection
falsepositives:
    - Unknown
level: medium
tags:
    - attack.persistence
    - attack.t1015